Revit 2024 API
RebarFreeFormAccessor.GetCustomDistributionPath Method
 Gets the custom distribution path for free form rebar set.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public IList<Curve> GetCustomDistributionPath()
Visual Basic
Public Function GetCustomDistributionPath As IList(Of Curve)
Visual C++
public:
IList<Curve^>^ GetCustomDistributionPath()
Return Value
 Returns an array of curves that represent the distribution path.
Remarks
 For a free form rebar set the distance between two consecutive bars may be different if it is calculated between different points on bars. The distribution path is an array of curves with the property that based on these curves the set was calculated to respect the layout rule and number of bars or spacing.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  This RebarFreeFormAccessor doesn't contain a valid rebar reference. -or- This RebarFreeFormAccessor Rebar doesn't contain a valid server GUID.
See Also
RebarFreeFormAccessor Class
Autodesk.Revit.DB.Structure Namespace